Revit 2021.1 API
FormatOptions Constructor
Overload List
Name | Description
FormatOptions()
 Creates a new FormatOptions object that represents default formatting.
FormatOptions(DisplayUnitType) |  Obsolete.
 Creates a new FormatOptions object that represents custom formatting.
FormatOptions(ForgeTypeId)
 Creates a new FormatOptions object that represents custom formatting.
FormatOptions(FormatOptions)
 Creates a copy of a FormatOptions object.
FormatOptions(DisplayUnitType, UnitSymbolType) |  Obsolete.
 Creates a new FormatOptions object that represents custom formatting.
FormatOptions(DisplayUnitType, Double) |  Obsolete.
 Creates a new FormatOptions object that represents custom formatting.
FormatOptions(ForgeTypeId, ForgeTypeId)
 Creates a new FormatOptions object that represents custom formatting.
FormatOptions(DisplayUnitType, UnitSymbolType, Double) |  Obsolete.
 Creates a new FormatOptions object that represents custom formatting.
See Also
FormatOptions Class
FormatOptions Members
Autodesk.Revit.DB Namespace